Infineon/cmsis_packs/TLE984x/Infineon.TLE984x_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>Licence\CMSIS_END_USER_LICENCE_AGREEMENT.txt</license>
  <vendor>Infineon</vendor>
  <url>https://github.com/Infineon/cmsis_packs/raw/master/TLE984x/</url>
  <name>TLE984x_DFP</name>
  <description>Infineon TLE984x Series Device Support</description>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact>
  
    <releases>
        <release version="1.1.1">
          Bug fixes on uart.c/.h, VDDEXT interrupt, external interrupts,
          CCU6 trap interrupt, T6 output pin configuration and
          T21 counter input selection.
        </release>
        <release version="1.1.0">
          Interrupt structure improved
          PMU added to minimum configuration
          project structure changed to local files
          bug fixes
        </release>
        <release version="1.0.0">
          TLE984x Device Family Pack.
        </release>
    </releases>

    <keywords>
        <!-- keywords for indexing -->
        <keyword>Infineon</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Infineon</keyword>
        <keyword>TLE984x</keyword>
    </keywords>

    <devices>
        <family Dfamily="TLE98xx Series" Dvendor="Infineon:7">
            <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>

            <description>
                The TLE984x series is designed for relais based motor drive applications with LIN/PWM interface
                - Ultra low power consumption
                - Nested Vectored Interrupt Controller (NVIC)
                - integrated LIN tranceiver
            </description>

            <environment name="uv">
                <AMisc>--cpreproc</AMisc>
            </environment>

            <feature type="WDT"           n="1"/>
            <feature type="ComOther"      n="2"                           name="Universal Serial Interface"/>
            <feature type="Temp"          n="-40"     m="150"             name="all Devices"/>

            <subFamily DsubFamily="TLE984x Series">
                <device Dname="TLE9842QX">
                    <processor Dclock="25000000"/>
                    <compile header="Device\Include\tle984x.h" define="TLE9842QX"/>
                    <debug      svd="SVD\TLE984x.svd"/>
                    <memory     id="IROM1"                      start="0x11000000"  size="0x9000"     startup="1"   default="1"/>
                    <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
                    <memory     id="IRAM1"                      start="0x18000000"  size="0x800"      init   ="0"   default="1"/>
                    <algorithm  name="Flash\TLE9842.FLM"        start="0x11000000"  size="0x8000"                   default="1"/>
                    <algorithm  name="Flash\TLE9842_EEP.FLM"    start="0x11008000"  size="0x1000"                   default="1"/>
                    <algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
                    <book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
                    <book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
                    <book    name="Documents\Infineon-TLE9842QX-DS-01_00-EN.pdf"    title="TLE9842QX Data Sheet"/>
                    <feature type="ADC"           n="1"       m="10"/>
                    <feature type="ADC"           n="1"       m="8"/>
                    <feature type="IOs"           n="11"/>
                </device>
                <device Dname="TLE9842-2QX">
                    <processor Dclock="40000000"/>
                    <compile header="Device\Include\tle984x.h" define="TLE9842_2QX"/>
                    <debug      svd="SVD\TLE984x.svd"/>
                    <memory     id="IROM1"                      start="0x11000000"  size="0xA000"     startup="1"   default="1"/>
                    <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
                    <memory     id="IRAM1"                      start="0x18000000"  size="0x800"      init   ="0"   default="1"/>
                    <algorithm  name="Flash\TLE9842_2.FLM"      start="0x11000000"  size="0x9000"                   default="1"/>
                    <algorithm  name="Flash\TLE9842_2_EEP.FLM"  start="0x11009000"  size="0x1000"                   default="1"/>
                    <algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
                    <book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
                    <book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
                    <book    name="Documents\Infineon-TLE9842-2QX-DS-01_00-EN.pdf"  title="TLE9842-2QX Data Sheet"/>
                    <feature type="ADC"           n="1"       m="10"/>
                    <feature type="ADC"           n="1"       m="8"/>
                    <feature type="IOs"           n="11"/>
                </device>
                <device Dname="TLE9843QX">
                    <processor Dclock="25000000"/>
                    <compile header="Device\Include\tle984x.h" define="TLE9843QX"/>
                    <debug      svd="SVD\TLE984x.svd"/>
                    <memory     id="IROM1"                      start="0x11000000"  size="0xC000"     startup="1"   default="1"/>
                    <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
                    <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
                    <algorithm  name="Flash\TLE9843.FLM"        start="0x11000000"  size="0xB000"                   default="1"/>
                    <algorithm  name="Flash\TLE9843_EEP.FLM"    start="0x1100B000"  size="0x1000"                   default="1"/>
                    <algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
                    <book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
                    <book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
                    <book    name="Documents\Infineon-TLE9843QX-DS-01_00-EN.pdf"    title="TLE9843QX Data Sheet"/>
                    <feature type="ADC"           n="1"       m="10"/>
                    <feature type="ADC"           n="1"       m="8"/>
                    <feature type="IOs"           n="11"/>
                </device>
                <device Dname="TLE9843-2QX">
                    <processor Dclock="40000000"/>
                    <compile header="Device\Include\tle984x.h" define="TLE9843_2QX"/>
                    <debug      svd="SVD\TLE984x.svd"/>
                    <memory     id="IROM1"                      start="0x11000000"  size="0D000"      startup="1"   default="1"/>
                    <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
                    <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
                    <algorithm  name="Flash\TLE9843_2.FLM"      start="0x11000000"  size="0xC000"                   default="1"/>
                    <algorithm  name="Flash\TLE9843_2_EEP.FLM"  start="0x1100C000"  size="0x1000"                   default="1"/>
                    <algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
                    <book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
                    <book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
                    <book    name="Documents\Infineon-TLE9843-2QX-DS-01_00-EN.pdf"  title="TLE9843-2QX Data Sheet"/>
                    <feature type="ADC"           n="1"       m="10"/>
                    <feature type="ADC"           n="1"       m="8"/>
                    <feature type="IOs"           n="11"/>
                </device>
                <device Dname="TLE9844QX">
                    <processor Dclock="25000000"/>
                    <compile header="Device\Include\tle984x.h" define="TLE9844QX"/>
                    <debug      svd="SVD\TLE984x.svd"/>
                    <memory     id="IROM1"                      start="0x11000000"  size="0x10000"    startup="1"   default="1"/>
                    <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
                    <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
                    <algorithm  name="Flash\TLE9844.FLM"        start="0x11000000"  size="0xF000"                   default="1"/>
                    <algorithm  name="Flash\TLE9844_EEP.FLM"    start="0x1100F000"  size="0x1000"                   default="1"/>
                    <algorithm  name="Flash\TLE984x_OPT.FLM"    start="0x10FFFFFC"  size="4"                        default="1"/>
                    <book    name="Documents\Infineon-TLE984xQX-UM-01_00-EN.pdf"    title="TLE984x Series User Manual"/>
                    <book    name="Documents\Infineon-TLE984x-FWUM-01_01-EN.pdf"    title="TLE984x Series Firmware User Manual"/>
                    <book    name="Documents\Infineon-TLE9844QX-DS-01_00-EN.pdf"    title="TLE9844QX Data Sheet"/>
                    <feature type="ADC"           n="1"       m="10"/>
                    <feature type="ADC"           n="1"       m="8"/>
                    <feature type="IOs"           n="11"/>
                </device>
