Infineon/cmsis_packs/TLE984x/Infineon.TLE984x_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.5" condition="TLE984x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="Device\SDK\inc\wdt1.h" version="0.2.5"/>
        <file category="source" attr="config" name="Device\SDK\src\wdt1.c" version="0.2.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.3" condition="TLE984x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PMU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\pmu_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\pmu_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\pmu_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\pmu_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\pmu_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\pmu_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\pmu_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\pmu.h" version="0.1.3"/>
        <file category="source" attr="config" name="Device\SDK\src\pmu.c" version="0.1.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.1.7" condition="TLE984x CMSIS Device">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC1
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\adc1_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\adc1_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\adc1_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\adc1_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\adc1_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\adc1_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\adc1_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\adc1.h" version="0.1.7"/>
        <file category="source" attr="config" name="Device\SDK\src\adc1.c" version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.6" condition="TLE984x CMSIS Device">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC2
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\adc2_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\adc2_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\adc2_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\adc2_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\adc2_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\adc2_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\adc2_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\adc2.h" version="0.1.6"/>
        <file category="source" attr="config" name="Device\SDK\src\adc2.c" version="0.1.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.3" condition="TLE984x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CCU6
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\ccu6_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\ccu6_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\ccu6_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\ccu6_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\ccu6_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\ccu6_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\ccu6_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\ccu6.h" version="0.2.3"/>
        <file category="source" attr="config" name="Device\SDK\src\ccu6.c" version="0.2.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="HS" Cversion="0.1.7" condition="TLE984x CMSIS Device">
      <description>High Side driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_HS
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\hs_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\hs_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\hs_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\hs_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\hs_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\hs_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\hs_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\hs.h" version="0.1.7"/>
        <file category="source" attr="config" name="Device\SDK\src\hs.c" version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LS" Cversion="0.1.4" condition="TLE984x CMSIS Device">
      <description>Low Side driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LS
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\ls_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\ls_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\ls_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\ls_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\ls_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\ls_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\ls_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\ls.h" version="0.1.4"/>
        <file category="source" attr="config" name="Device\SDK\src\ls.c" version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.4" condition="TLE984x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_GPT12E
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\gpt12e_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\gpt12e_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\gpt12e_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\gpt12e_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\gpt12e_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\gpt12e_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\gpt12e_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\gpt12e.h" version="0.1.4"/>
        <file category="source" attr="config" name="Device\SDK\src\gpt12e.c" version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.4" condition="TLE984x CMSIS Device">
      <description>Interrupt (INT) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_INT
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\int_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\int_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\int_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\int_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\int_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\int_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\int_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\int.h" version="0.1.4"/>
        <file category="source" attr="config" name="Device\SDK\src\int.c" version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.1.8" condition="TLE984x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ISR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\isr_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\isr_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\isr_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\isr_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\isr_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\isr_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\isr_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\isr.h" version="0.1.8"/>
        <file category="source" attr="config" name="Device\SDK\src\isr.c" version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.4" condition="TLE984x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE984x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LIN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842QX\lin_defines.h" attr="config" condition="TLE9842QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9842-2QX\lin_defines.h" attr="config" condition="TLE9842-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843QX\lin_defines.h" attr="config" condition="TLE9843QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9843-2QX\lin_defines.h" attr="config" condition="TLE9843-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844QX\lin_defines.h" attr="config" condition="TLE9844QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9844-2QX\lin_defines.h" attr="config" condition="TLE9844-2QX" version="1.2.1"/>
        <file category="header" name="Device\SDK\cfgwiz\TLE9845QX\lin_defines.h" attr="config" condition="TLE9845QX" version="1.2.1"/>
        <file category="header" attr="config" name="Device\SDK\inc\lin.h" version="0.1.4"/>
        <file category="source" attr="config" name="Device\SDK\src\lin.c" version="0.1.4"/>
      </files>
    </component>

