Infineon/cmsis_packs/TLE984x/Infineon.TLE984x_DFP.pdsc
    <example name="GPT12E_T3_CONCAT" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\GPT12E_T3_CONCAT\">
      <description>Timer2 and Timer3 as 32bit Timer</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="GPT12E_T3_CONCAT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="UART1_SEND" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\UART1_SEND\">
      <description>UART1 sends data over LIN Transceiver</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART1_SEND.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="UART"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="LIN"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="SSC1_SEND" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\SSC1_SEND\">
      <description>SSC1 sends data as SPI Master</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SSC1_SEND.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SSC"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="SSC1_2_SSC2" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\SSC1_2_SSC2\">
      <description>SSC1 sends to SSC2</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SSC1_2_SSC2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SSC"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="CCU6_PWM" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\CCU6_PWM\">
      <description>CCU6 generates PWM signals</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CCU6_PWM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="CCU6_ADC1" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\CCU6_ADC1\">
      <description>PWM synchroneous ADC measurement, the Poti at Channel 4 adjusts the PWM</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CCU6_ADC1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="UART2_TTY" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\UART2_TTY\">
      <description>UART2 sends printf messages</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART2_TTY.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="UART"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="LIN Slave" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\LIN_Slave\">
      <description>running the IHR LIN LLD in a LIN Slave configuration</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="LIN_Slave.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="LIN"/>
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="UART"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="LIN Master" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\LIN_Master\">
      <description>running the IHR LIN LLD in a LIN Master configuration</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="LIN_Master.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="LIN"/>
        <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="UART"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="Relais" doc="Abstract.txt" folder="Boards\Infineon\TLE984x_EvalBoard\Relais_Example\">
      <description>switches HS and LS with MONx buttons</description>
      <board name="TLE984x Eval.Board Rev1.4" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Relais_Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="HS"/>
        <component Cclass="Device" Cgroup="SDK" Csub="LS"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

  </examples>
  
</package>
